{"Size":"159238646","Description":"[h1] The netcode plugin is broken at the moment which makes the game crash[/h1]\r\nI'll update this page once the issue is resolved :)\r\n\r\n[b]V0.93[/b]\r\n[h1] Get ready for the battle! [/h1]\r\n\r\n[b]In \"Rumble 2.0: The Clan War\" each team can have its own set of power ups[/b]! This mod is initially designed to have 2 clans playing against each other: The almighty [b]wizards[/b] vs the sneaky [b]ninjas[/b].\r\nWith different power ups I tried to make a balanced fight between these 2!\r\n\r\nAdditionally, you have the option to customise the team's set of attacks, to create your own battle with the [b]20 power ups[/b] that this mod offers.\r\nA team with 0 powers vs a team that has them all is perfectly doable!\r\n\r\nThe mod supports up to 3 players per team.\r\n\r\nThe [url=https://bakkesplugins.com/plugins/view/166][b]Netcode plugin is required[/b][/url]. If you start the map without it, instructions will appear to help you get it.\r\nYou might need the [url=https://drive.google.com/drive/folders/1fvMMw0jGkkGr0fZpme9tWlwD3hC5LX0W][b]Workshop textures[/b][/url] to play with other people. I don't think it's required for this mod but if the host has it you will need it to avoid content mismatch. Put it in your game files - rocketleague\\TAGame\\CookedPCConsole - you can create a folder \"mods\" and put the workshop textures folder inside, that's it.\r\n\r\n[i]Make sure to check the known issues in the discussions below[/i]\r\n\r\n\r\n[h1] Feedback [/h1]\r\n\r\nAny feedback is very welcome as I plan to tweak the systems to make it more enjoyable (power ups duration, targetting distance etc.)\r\nIf you encountered a new bug or seem to know how some bugs happen, or even if you everything is fine and you want to share your experience with me, don't hesitate to join my discord or contact me on Twitter! :D\r\nhttps://discord.gg/NfwJkGAh6r\r\n\r\n\r\n[h1]Support me[/h1]\r\n\r\nIf you make content with my mod, please credit me and share some of these info, it would help me a lot :)\r\nhttps://twitter.com/EcraseP\r\nhttps://www.youtube.com/channel/UC1YdMPxzfcM1lLFha0rgVwQ\r\n\r\nIf you would like to donate, you can\r\nCheck my patreon: https://www.patreon.com/ecrasepatate\r\nDonate on Paypal: https://www.paypal.com/paypalme/ecrasepatate\r\n\r\n\r\n[h1] Special thanks [/h1]\r\n\r\nThanks to [url=https://twitter.com/littlestick8bit]littlestick8bit[/url] for designing the icons.\r\nThanks to [url=https://twitter.com/CinderBlockCB]Cinderblock[/url] for providing the Netcode plugin. This mod could not exist without it!\r\nThanks to [url=https://twitter.com/MrPh1l_]MrPhil[/url] for fixing several things in my map like it's nothing :D\r\n\r\nThanks to everyone who supported me, including my playtesters: \r\nSundr0, GreenGoFantastic, Sparrowhawk, TTHYMETV, Zuratu, Skourch, Toad, broyo209, Josh420, BalancedWaffle, Atomizer, Kieran_, Shark, Mr.Swaggles, CommunistCowboy, Suarezkid, DieselFuryy."}