{"Size":"83618658","Description":"Update by Lethamyr: https://steamcommunity.com/sharedfiles/filedetails/?id=1681397558\u0026searchtext=water\r\n\r\nA simple water polo map, with water!\r\n\r\nNOTE: This was made for exibition, not for training so is currently not supported by the workshop update :( For now you can just try it out (if the ball doesn't spawn, use the ball reset). Also, support files are not working at the moment either, so sorry for the poor visuals!\r\n\r\n---------------------------------------------------------------------------------------------------------------\r\n\r\nWater Polo in Rocket League, with custom water physics!\r\n\r\nGame Mechanics:\r\n\r\nBoost refills constantly (slowly), but refills faster in the water.\r\nBoost refills to 100% percent when hitting the water.\r\nBoost is more powerful underwater. Walls are slightly less sticky under water.\r\nBoost time for full boost is 20% longer, but only activates after the first goal (minor bug).\r\nDodge/jump resets when either entering or exiting the water. \r\nDodge/jump reset timer is infinite so you can use your flip no matter how long you have been in the air.\r\nWater Physics:\r\n\r\nMax speed in the water is set to around 2000uu which is slightly below supersonic, but the boost is faster so you can enter supersonic the second you leave the water. It allows for much more control whilst in the water (to the point that I can dribble the ball in the water, and I am not even that good!).\r\n'Water' is a gravity volume flipped upside down (650m/s, the opposite of RL gravity)\r\nWhilst in the water, the velocity is reduced on the car in all directions by 2%, 20 times a second. This causes the drag (but I do need feedback on this!)\r\nWhen the car enters the water, the angle of entry is calculated, converted to a percentage and applied to the velocity within some boundaries. Anything over a '80% perfect dive', so the middle 36°, will not affect the velocity. Anything below a '60% perfect dive', so the angles outside of the 54° range either side, will slow the car by 40% in the z-axis. The angles in between these values will use the percentage as a multiplier for the velocity so a '70% percent perfect dive' will slow the car by 30%. This works whether the nose of the back of the car enters first. (Sorry for the confusing description! Just ask if it is not clear).\r\nThis is my first map of any kind, so I would appreciate as much feedback as possible. \r\n\r\nPlanned updates:\r\n\r\nTweak water - more drag? Slow rotation of ball (Thanks FerrumVulpes for the idea)\r\nAdd ball skipping/skimming\r\nBoats...?\r\nKnown Bugs:\r\n\r\nSpawns sometime put you on the wrong side\r\nBoost length increase only activated after first goal."}